read_verilog ./examples/verilog/Parallax/parallax/parallax.v

hierarchy
proc
techmap -map +/adff2dff.v

synth -flatten -auto-top

abc -lut 4
clean

write_blif -impltf ./examples/verilog/Parallax/parallax/parallax.blif
